import os
import django

os.environ.setdefault('DJANGO_SETTINGS_MODULE', 'bookbot.settings')
django.setup()

from books.models import Genre, Author, Book

# Очистка старых данных
Genre.objects.all().delete()
Author.objects.all().delete()
Book.objects.all().delete()

data = {

    "Фантастика": {
        "Айзек Азимов": [
            ("Основание", "Легендарная сага о будущем человечества.", 4.9),
            ("Я, робот", "Истории про роботов и искусственный интеллект.", 4.8)
        ],

        "Рэй Брэдбери": [
            ("451 градус по Фаренгейту", "Антиутопия о мире без книг.", 4.9),
            ("Марсианские хроники", "Рассказы о колонизации Марса.", 4.7)
        ]
    },

    "Детектив": {
        "Агата Кристи": [
            ("Убийство в Восточном экспрессе", "Знаменитое расследование Пуаро.", 4.9),
            ("Десять негритят", "Детектив на острове.", 4.8)
        ],

        "Артур Конан Дойл": [
            ("Шерлок Холмс", "Лучшие расследования Холмса.", 5.0),
            ("Собака Баскервилей", "Мистический детектив.", 4.8)
        ]
    },

    "Фэнтези": {
        "Джон Толкин": [
            ("Властелин колец", "Эпическое путешествие Средиземья.", 5.0),
            ("Хоббит", "Приключения Бильбо Бэггинса.", 4.9)
        ],

        "Джоан Роулинг": [
            ("Гарри Поттер и философский камень", "Начало истории Гарри.", 5.0),
            ("Гарри Поттер и Тайная комната", "Вторая часть приключений.", 4.9)
        ]
    },

    "Роман": {
        "Джейн Остин": [
            ("Гордость и предубеждение", "Классический роман о любви.", 4.8),
            ("Разум и чувства", "История двух сестёр.", 4.7)
        ],

        "Лев Толстой": [
            ("Анна Каренина", "Трагическая история любви.", 4.9),
            ("Война и мир", "Исторический роман-эпопея.", 5.0)
        ]
    },

    "Ужасы": {
        "Стивен Кинг": [
            ("Оно", "История ужасающего клоуна.", 4.8),
            ("Сияние", "Психологический хоррор.", 4.9)
        ],

        "Говард Лавкрафт": [
            ("Зов Ктулху", "Космический ужас.", 4.7),
            ("Хребты безумия", "Экспедиция в Антарктиду.", 4.8)
        ]
    }

}

for genre_name, authors in data.items():

    genre = Genre.objects.create(name=genre_name)

    for author_name, books in authors.items():

        author = Author.objects.create(
            name=author_name,
            genre=genre
        )

        for title, description, rating in books:

            Book.objects.create(
                title=title,
                author=author,
                description=description,
                rating=rating
            )

print("база книг создана!")